In [2]:
pip install mysql-connector-python SQLAlchemy

Requirement already satisfied: mysql-connector-python in c:\users\ankit\anaconda3\lib\site-packages (9.4.0)
Requirement already satisfied: SQLAlchemy in c:\users\ankit\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ankit\anaconda3\lib\site-packages (from SQLAlchemy) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np
import mysql.connector
from sqlalchemy import create_engine

In [4]:
!pip install xlrd==2.0.1

Requirement already satisfied: xlrd==2.0.1 in c:\users\ankit\anaconda3\lib\site-packages (2.0.1)

In [5]:
df = pd.read_excel("C:/Users/ANKIT/Documents/BEPEC/INX future project/INX_Future_Inc_Employee_Performance_CDS_Project2_Data_V1.8.xlsx")
df.head()

,EmpNumber,Age,Gender,EducationBackground,MaritalStatus,EmpDepartment,EmpJobRole,BusinessTravelFrequency,DistanceFromHome,EmpEducationLevel,...,EmpRelationshipSatisfaction,TotalWorkExperienceInYears,TrainingTimesLastYear,EmpWorkLifeBalance,ExperienceYearsAtThisCompany,ExperienceYearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,Attrition,PerformanceRating
0,E1001000,32,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,10,3,...,4,10,2,2,10,7,0,8,No,3
1,E1001006,47,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,14,4,...,4,20,2,3,7,7,1,7,No,3
2,E1001007,40,Male,Life Sciences,Married,Sales,Sales Executive,Travel_Frequently,5,4,...,3,20,2,3,18,13,1,12,No,4
3,E1001009,41,Male,Human Resources,Divorced,Human Resources,Manager,Travel_Rarely,10,4,...,2,23,2,2,21,6,12,6,No,3
4,E1001010,60,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,16,4,...,4,10,1,3,2,2,2,2,No,3

In [6]:
df.isnull().sum()

EmpNumber                       0
Age                             0
Gender                          0
EducationBackground             0
MaritalStatus                   0
EmpDepartment                   0
EmpJobRole                      0
BusinessTravelFrequency         0
DistanceFromHome                0
EmpEducationLevel               0
EmpEnvironmentSatisfaction      0
EmpHourlyRate                   0
EmpJobInvolvement               0
EmpJobLevel                     0
EmpJobSatisfaction              0
NumCompaniesWorked              0
OverTime                        0
EmpLastSalaryHikePercent        0
EmpRelationshipSatisfaction     0
TotalWorkExperienceInYears      0
TrainingTimesLastYear           0
EmpWorkLifeBalance              0
ExperienceYearsAtThisCompany    0
ExperienceYearsInCurrentRole    0
YearsSinceLastPromotion         0
YearsWithCurrManager            0
Attrition                       0
PerformanceRating               0
dtype: int64

In [7]:
df.shape

(1200, 28)

In [8]:
df.isna().sum()

EmpNumber                       0
Age                             0
Gender                          0
EducationBackground             0
MaritalStatus                   0
EmpDepartment                   0
EmpJobRole                      0
BusinessTravelFrequency         0
DistanceFromHome                0
EmpEducationLevel               0
EmpEnvironmentSatisfaction      0
EmpHourlyRate                   0
EmpJobInvolvement               0
EmpJobLevel                     0
EmpJobSatisfaction              0
NumCompaniesWorked              0
OverTime                        0
EmpLastSalaryHikePercent        0
EmpRelationshipSatisfaction     0
TotalWorkExperienceInYears      0
TrainingTimesLastYear           0
EmpWorkLifeBalance              0
ExperienceYearsAtThisCompany    0
ExperienceYearsInCurrentRole    0
YearsSinceLastPromotion         0
YearsWithCurrManager            0
Attrition                       0
PerformanceRating               0
dtype: int64

In [9]:
df["Attrition"].apply(lambda x: 1 if str(x).lower() == 'yes' else 0)

0       0
1       0
2       0
3       0
4       0
       ..
1195    0
1196    0
1197    0
1198    0
1199    1
Name: Attrition, Length: 1200, dtype: int64

In [10]:
df['Attrition'].value_counts()

No     1022
Yes     178
Name: Attrition, dtype: int64

In [11]:
df["Attrition"] = df["Attrition"].astype(str).str.strip().str.lower()
print(df["Attrition"].unique())

['no' 'yes']

In [12]:
#df["Attrition"]= df["Attrition"].apply(lambda x: 1 if str(x) == 'yes' else 0)
df['Attrition'].value_counts()

no     1022
yes     178
Name: Attrition, dtype: int64

In [13]:
df['Attrition'].unique()

array(['no', 'yes'], dtype=object)

In [14]:
df.head(5)

,EmpNumber,Age,Gender,EducationBackground,MaritalStatus,EmpDepartment,EmpJobRole,BusinessTravelFrequency,DistanceFromHome,EmpEducationLevel,...,EmpRelationshipSatisfaction,TotalWorkExperienceInYears,TrainingTimesLastYear,EmpWorkLifeBalance,ExperienceYearsAtThisCompany,ExperienceYearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,Attrition,PerformanceRating
0,E1001000,32,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,10,3,...,4,10,2,2,10,7,0,8,no,3
1,E1001006,47,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,14,4,...,4,20,2,3,7,7,1,7,no,3
2,E1001007,40,Male,Life Sciences,Married,Sales,Sales Executive,Travel_Frequently,5,4,...,3,20,2,3,18,13,1,12,no,4
3,E1001009,41,Male,Human Resources,Divorced,Human Resources,Manager,Travel_Rarely,10,4,...,2,23,2,2,21,6,12,6,no,3
4,E1001010,60,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,16,4,...,4,10,1,3,2,2,2,2,no,3

In [15]:
df['ExternalExperience'] = df['TotalWorkExperienceInYears'] - df['ExperienceYearsAtThisCompany']
df.columns

Index(['EmpNumber', 'Age', 'Gender', 'EducationBackground', 'MaritalStatus',
       'EmpDepartment', 'EmpJobRole', 'BusinessTravelFrequency',
       'DistanceFromHome', 'EmpEducationLevel', 'EmpEnvironmentSatisfaction',
       'EmpHourlyRate', 'EmpJobInvolvement', 'EmpJobLevel',
       'EmpJobSatisfaction', 'NumCompaniesWorked', 'OverTime',
       'EmpLastSalaryHikePercent', 'EmpRelationshipSatisfaction',
       'TotalWorkExperienceInYears', 'TrainingTimesLastYear',
       'EmpWorkLifeBalance', 'ExperienceYearsAtThisCompany',
       'ExperienceYearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager', 'Attrition', 'PerformanceRating',
       'ExternalExperience'],
      dtype='object')

In [16]:
df.head(5)

,EmpNumber,Age,Gender,EducationBackground,MaritalStatus,EmpDepartment,EmpJobRole,BusinessTravelFrequency,DistanceFromHome,EmpEducationLevel,...,TotalWorkExperienceInYears,TrainingTimesLastYear,EmpWorkLifeBalance,ExperienceYearsAtThisCompany,ExperienceYearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,Attrition,PerformanceRating,ExternalExperience
0,E1001000,32,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,10,3,...,10,2,2,10,7,0,8,no,3,0
1,E1001006,47,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,14,4,...,20,2,3,7,7,1,7,no,3,13
2,E1001007,40,Male,Life Sciences,Married,Sales,Sales Executive,Travel_Frequently,5,4,...,20,2,3,18,13,1,12,no,4,2
3,E1001009,41,Male,Human Resources,Divorced,Human Resources,Manager,Travel_Rarely,10,4,...,23,2,2,21,6,12,6,no,3,2
4,E1001010,60,Male,Marketing,Single,Sales,Sales Executive,Travel_Rarely,16,4,...,10,1,3,2,2,2,2,no,3,8

In [37]:
df.std(axis=None)

C:\Users\ANKIT\AppData\Local\Temp\ipykernel_8076\1193620216.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std(axis=None)

Age                              9.087289
DistanceFromHome                 8.176636
EmpEducationLevel                1.044120
EmpEnvironmentSatisfaction       1.090599
EmpHourlyRate                   20.211302
EmpJobInvolvement                0.707164
EmpJobLevel                      1.107836
EmpJobSatisfaction               1.100888
NumCompaniesWorked               2.469384
EmpLastSalaryHikePercent         3.625918
EmpRelationshipSatisfaction      1.075642
TotalWorkExperienceInYears       7.797228
TrainingTimesLastYear            1.263446
EmpWorkLifeBalance               0.699374
ExperienceYearsAtThisCompany     6.236899
ExperienceYearsInCurrentRole     3.613744
YearsSinceLastPromotion          3.221560
YearsWithCurrManager             3.541576
PerformanceRating                0.518866
ExternalExperience               6.170533
dtype: float64

In [22]:
from sqlalchemy import create_engine

In [24]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\ankit\anaconda3\lib\site-packages (1.1.2)

In [26]:
engine = create_engine("mysql+pymysql://root:root@localhost:3306/inx")
engine

Engine(mysql+pymysql://root:***@localhost:3306/inx)

In [27]:
tables = pd.read_sql("SHOW TABLES;", engine)
print(tables)

Empty DataFrame
Columns: [Tables_in_inx]
Index: []

In [28]:
df.to_sql("employees", con=engine, if_exists="replace", index=False)

1200

In [30]:
check = pd.read_sql("SHOW TABLES;", engine)
print(check)

  Tables_in_inx
0     employees

In [31]:
preview = pd.read_sql("SELECT * FROM employees LIMIT 10;", engine)
print(preview)

  EmpNumber  Age  Gender EducationBackground MaritalStatus    EmpDepartment  \
0  E1001000   32    Male           Marketing        Single            Sales
1  E1001006   47    Male           Marketing        Single            Sales
2  E1001007   40    Male       Life Sciences       Married            Sales
3  E1001009   41    Male     Human Resources      Divorced  Human Resources
4  E1001010   60    Male           Marketing        Single            Sales
5  E1001011   27    Male       Life Sciences      Divorced      Development
6  E1001016   50    Male           Marketing       Married            Sales
7  E1001019   28  Female       Life Sciences        Single      Development
8  E1001020   36  Female       Life Sciences       Married      Development
9  E1001021   38  Female       Life Sciences        Single      Development

             EmpJobRole BusinessTravelFrequency  DistanceFromHome  \
0       Sales Executive           Travel_Rarely                10
1       Sales Executive           Travel_Rarely                14
2       Sales Executive       Travel_Frequently                 5
3               Manager           Travel_Rarely                10
4       Sales Executive           Travel_Rarely                16
5             Developer       Travel_Frequently                10
6  Sales Representative           Travel_Rarely                 8
7             Developer           Travel_Rarely                 1
8             Developer              Non-Travel                 8
9             Developer           Travel_Rarely                 1

   EmpEducationLevel  ...  TotalWorkExperienceInYears  TrainingTimesLastYear  \
0                  3  ...                          10                      2
1                  4  ...                          20                      2
2                  4  ...                          20                      2
3                  4  ...                          23                      2
4                  4  ...                          10                      1
5                  2  ...                           9                      4
6                  4  ...                           4                      2
7                  2  ...                          10                      4
8                  3  ...                          10                      2
9                  3  ...                          10                      4

   EmpWorkLifeBalance  ExperienceYearsAtThisCompany  \
0                   2                            10
1                   3                             7
2                   3                            18
3                   2                            21
4                   3                             2
5                   2                             9
6                   3                             2
7                   3                             7
8                   3                             8
9                   4                             1

   ExperienceYearsInCurrentRole  YearsSinceLastPromotion YearsWithCurrManager  \
0                             7                        0                    8
1                             7                        1                    7
2                            13                        1                   12
3                             6                       12                    6
4                             2                        2                    2
5                             7                        1                    7
6                             2                        2                    2
7                             7                        3                    7
8                             7                        0                    5
9                             0                        0                    0

   Attrition  PerformanceRating  ExternalExperience
0         no                  3                   0
1         no                  3                  13
2         no                  4                   2
3         no                  3                   2
4         no                  3                   8
5         no                  4                   0
6         no                  3                   2
7        yes                  3                   3
8         no                  3                   2
9         no                  3                   9

[10 rows x 29 columns]